app/controllers/resources_controller.rb

SELECT * FROM `resources`
---
def index
  @resources = Resource.all

SELECT * FROM `resources` WHERE (username = 'name' and resource_type= '% ' )
---
def show
  if params[:resource_type]
    resource_type=params[:resource_type]
  else
    resource_type='%'
  end
  p  params[:username]
  @resources = Resource.find(:all,
    :conditions =>["username = ?  ",params[:username]])

SELECT * FROM `resources` WHERE (`resources`.`id` = 16)
---
def edit
  @resource = Resource.find(params[:id])

SELECT * FROM `resources`
---
def create

  #   @resources2 = Resource.all
  @resources= Resource.all

INSERT INTO `resources` (`created_at`, `resource_type`, `resource_id`, `updated_at`, `username`, `user_id`) VALUES('2011-05-22 07:34:42', 'device|gateway ', 'url', '2011-05-22 07:34:42', 'name', NULL)
---
        @resource.username = temp['username']
        @resource.resource_id = temp['resource_id']
        @resource.resource_type = temp['resource_type']
        @resource.save